src/cf/InformationRegisters/АналогиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АналогиНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ор_Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ор_Обратимость</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Аналог</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/АналогиНоменклатуры/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ор_ПрограммноеСозданиеЭлементовФорм.СоздатьЭлементыФормы(ЭтотОбъект);
	
	Если НЕ ЗначениеЗаполнено(Запись.Аналог) Тогда
		Запись.Приоритет      = ПолучитьПриоритетВСписке(Запись.Номенклатура);
		Запись.ор_Коэффициент = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Запись.Номенклатура = Запись.Аналог Тогда
		СтрокаСообщения = НСтр("ru = 'Значение полей ""Номенклатура"" и ""Аналог"" не могут совпадать.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(СтрокаСообщения,,ЭтаФорма);
		Отказ = Истина;
	КонецЕсли;
	
	Если Не ЭтотОбъект.БылаЗаписьОбратнойЗамены Тогда
		ВыполнитьОбратнуюЗамену(Отказ, ПараметрыЗаписи);
	КонецЕсли;
	
	БылаЗапись = Не Отказ;
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы И БылаЗапись Тогда
		
		СтруктураПараметров = Новый Структура("Номенклатура, Аналог", Запись.Номенклатура, Запись.Аналог);
		
		Оповестить("ЗаписьАналога", СтруктураПараметров, "ФормаЗаписи");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура Подключаемый_ЭлементПриИзменении(Элемент)
	ЭтотОбъект.БылаЗаписьОбратнойЗамены = Ложь;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПриоритетВСписке(Номенклатура)
	
	// Сначала выясним значение первого меньшего приоритета.
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	Аналоги.Аналог КАК Аналог,
	|	Аналоги.Приоритет КАК Приоритет
	|ИЗ
	|	РегистрСведений.АналогиНоменклатуры КАК Аналоги
	|ГДЕ
	|	Аналоги.Номенклатура = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет УБЫВ");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	ПервыйПриоритет = 0;
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ПервыйПриоритет = Выборка.Приоритет + 1;
	КонецЕсли;
	
	Возврат ПервыйПриоритет;
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьОбратныйКоэффициент(Номенклатура, Аналог)
	
	// Проверим, а есть ли уже обратная замена.
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Аналоги.Номенклатура КАК Номенклатура,
	|	Аналоги.Аналог КАК Аналог,
	|	Аналоги.ор_Коэффициент КАК Коэффициент
	|ИЗ
	|	РегистрСведений.АналогиНоменклатуры КАК Аналоги
	|ГДЕ
	|	Аналоги.Номенклатура = &Аналог
	|	И Аналоги.Аналог = &Номенклатура");
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Аналог", Аналог);
	
	// Если таковой нет, то добавим.
	ОбратныйКоэффициент = 0;
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОбратныйКоэффициент = Выборка.Коэффициент;
	КонецЕсли;
	
	Возврат ОбратныйКоэффициент;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ВыполнитьЗаписьДляОбратнойЗамены(Номенклатура, Аналог, КоэффициентЗамены, Обратимость)
	
	Если Обратимость Тогда
		НоваяЗапись = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
		НоваяЗапись.Номенклатура = Аналог;
		НоваяЗапись.Аналог       = Номенклатура;
		НоваяЗапись.Прочитать();
		Если НЕ НоваяЗапись.Выбран() Тогда
			НоваяЗапись.Приоритет = ПолучитьПриоритетВСписке(Аналог);
		КонецЕсли;
		НоваяЗапись.ор_Коэффициент = КоэффициентЗамены;
		НоваяЗапись.ор_Обратимость = Истина;
		НоваяЗапись.Номенклатура   = Аналог;
		НоваяЗапись.Аналог         = Номенклатура;
		НоваяЗапись.Записать();
	Иначе
		НоваяЗапись = РегистрыСведений.АналогиНоменклатуры.СоздатьМенеджерЗаписи();
		НоваяЗапись.Номенклатура = Аналог;
		НоваяЗапись.Аналог       = Номенклатура;
		НоваяЗапись.Прочитать();
		НоваяЗапись.Удалить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбратнуюЗамену(Отказ, ПараметрыЗаписи)
	
	Если НЕ ЗначениеЗаполнено(Запись.Аналог) Тогда
		Возврат;
	КонецЕсли;
	
	КоэффициентЗамены = Запись.ор_Коэффициент;
	Если Запись.ор_Обратимость Тогда
		ОбратныйКоэффициент = ПолучитьОбратныйКоэффициент(Запись.Номенклатура, Запись.Аналог);
		Если ОбратныйКоэффициент = 0 ИЛИ ОбратныйКоэффициент <> 1 ИЛИ КоэффициентЗамены <> 1 Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Номенклатура", Запись.Номенклатура);
			ПараметрыФормы.Вставить("Аналог", Запись.Аналог);
			ПараметрыФормы.Вставить("Коэффициент", ?(КоэффициентЗамены > 0, 1 / КоэффициентЗамены, 1));
			
			ОткрытьФорму(
				"РегистрСведений.АналогиНоменклатуры.Форма.ФормаОбратимости",
				ПараметрыФормы,
				ЭтотОбъект,,,,
				Новый ОписаниеОповещения("ВыполнитьОбратнуюЗаменуЗавершение", ЭтотОбъект, ПараметрыЗаписи),
				РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
			Отказ = Истина;
		КонецЕсли;
	Иначе
		ВыполнитьЗаписьДляОбратнойЗамены(Запись.Номенклатура, Запись.Аналог, КоэффициентЗамены, Запись.ор_Обратимость);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьОбратнуюЗаменуЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> Неопределено И Результат.Свойство("Коэффициент") Тогда
		КоэффициентЗамены = Результат.Коэффициент;
	Иначе
		КоэффициентЗамены = ?(Запись.ор_Коэффициент > 0,1 / Запись.ор_Коэффициент, 1);
	КонецЕсли;
	ВыполнитьЗаписьДляОбратнойЗамены(Запись.Номенклатура, Запись.Аналог, КоэффициентЗамены, Запись.ор_Обратимость);
	
	ЭтотОбъект.БылаЗаписьОбратнойЗамены = Истина;
	
	Записать(ДополнительныеПараметры);
	
КонецПроцедуры

#КонецОбласти
